# Load data

In [2]:
import pandas as pd 

df = pd.read_csv('Dataset/employees.csv - employees.csv', delimiter=';')
df

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,0.0,0,90
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1987-06-18,AD_VP,17000.0,0.0,100,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1987-06-19,AD_VP,17000.0,0.0,100,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1987-06-20,IT_PROG,9000.0,0.0,102,60
4,104,Bruce,Ernst,BERNST,590.423.4568,1987-06-21,IT_PROG,6000.0,0.0,103,60
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,1987-09-27,MK_REP,6000.0,0.0,201,20
103,203,Susan,Mavris,SMAVRIS,515.123.7777,1987-09-28,HR_REP,6500.0,0.0,101,40
104,204,Hermann,Baer,HBAER,515.123.8888,1987-09-29,PR_REP,10000.0,0.0,101,70
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,1987-09-30,AC_MGR,12000.0,0.0,101,110
106,206,William,Gietz,WGIETZ,515.123.8181,1987-10-01,AC_ACCOUNT,8300.0,0.0,205,110

# 1) How many entries are there in the employee dataset?

In [3]:
len(df)

107

# 2) How many departments are there in Zee organization?

In [4]:
len(df['DEPARTMENT_ID'].unique())

12

# 3) Find out the maximum salary that is given in each department?

In [5]:
df.groupby('DEPARTMENT_ID').max()['SALARY']

DEPARTMENT_ID
0       7000.0
10      4400.0
20     13000.0
30     11000.0
40      6500.0
50      8200.0
60      9000.0
70     10000.0
80     14000.0
90     24000.0
100    12000.0
110    12000.0
Name: SALARY, dtype: float64

# 4) Find out the detail of the employee who have got the minimum salary in the entire organization?

In [6]:
df[df['SALARY'] == df['SALARY'].min()]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
32,132,TJ,Olson,TJOLSON,650.124.8234,1987-07-19,ST_CLERK,2100.0,0.0,121,50

# 5) Find out the total salary amount that is given in each department? (salary of employee working in the same department should be added and displayed)

In [10]:
df.groupby('DEPARTMENT_ID').sum()['SALARY']

DEPARTMENT_ID
0        7000.0
10       4400.0
20      19000.0
30      24900.0
40       6500.0
50     156400.0
60      28800.0
70      10000.0
80     304500.0
90      58000.0
100     51600.0
110     20300.0
Name: SALARY, dtype: float64

# 6) Find out how many managers work in the organization?

In [11]:
len(df['MANAGER_ID'].unique())

19

# 7) Find out that how many employee works in each department?

In [13]:
df.groupby('DEPARTMENT_ID').count()['EMPLOYEE_ID']

DEPARTMENT_ID
0       1
10      1
20      2
30      6
40      1
50     45
60      5
70      1
80     34
90      3
100     6
110     2
Name: EMPLOYEE_ID, dtype: int64

# 8) Find out what is the maximum salary that is given to employee in this orgranization?

In [15]:
df[df['SALARY'] == df['SALARY'].max()]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,0.0,0,90

# 9) Find the details of all the employees whose job_id is "SA_MAN"?

In [16]:
df[df['JOB_ID'] == "SA_MAN"]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
45,145,John,Russell,JRUSSEL,011.44.1344.429268,1987-08-01,SA_MAN,14000.0,0.4,100,80
46,146,Karen,Partners,KPARTNER,011.44.1344.467268,1987-08-02,SA_MAN,13500.0,0.3,100,80
47,147,Alberto,Errazuriz,AERRAZUR,011.44.1344.429278,1987-08-03,SA_MAN,12000.0,0.3,100,80
48,148,Gerald,Cambrault,GCAMBRAU,011.44.1344.619268,1987-08-04,SA_MAN,11000.0,0.3,100,80
49,149,Eleni,Zlotkey,EZLOTKEY,011.44.1344.429018,1987-08-05,SA_MAN,10500.0,0.2,100,80

# 10) Find the average salary of each department?

In [17]:
df.groupby('DEPARTMENT_ID').mean()['SALARY']

DEPARTMENT_ID
0       7000.000000
10      4400.000000
20      9500.000000
30      4150.000000
40      6500.000000
50      3475.555556
60      5760.000000
70     10000.000000
80      8955.882353
90     19333.333333
100     8600.000000
110    10150.000000
Name: SALARY, dtype: float64

# 11) Find the number of employees working under every manager in the organization?

In [19]:
df.groupby('MANAGER_ID').count()['EMPLOYEE_ID']

MANAGER_ID
0       1
100    14
101     5
102     1
103     4
108     5
114     5
120     8
121     8
122     8
123     8
124     8
145     6
146     6
147     6
148     6
149     6
201     1
205     1
Name: EMPLOYEE_ID, dtype: int64